fixing md file
